Repository: jaanos/crypto-portal
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: sl

source: Let's think of a word whose length is equal to the number of columns in the network
sl: Izmislimo si neko besedo, katere dolžina je enaka številu stolpcev mreže

source: In our case this is equal to
sl: V našem primeru je to 6.

source: This word will be the key. Let's select the word
sl: Ta beseda bo predstavljala ključ. Izberimo besedo

source: and write it over our network.
sl: in jo zapišimo nad našo mrežo."

source: Let's attach numbers to each letter of the word, in a manner how they appear in the aplhabet. If one letter appears more than once, we number both apperances, in a manner how they appear in the word.
sl: Črke bomo označili s števili, kot si črke sledilo v abecedi. Če je v ključu več enakih črk, jih s števili označimo po vrsti tako, kot se nahajajo v besedi.

source: The columns are read by rows, as indicated by the numbers. Our secret record is
sl: Stolpce preberemo po vrsti, tako kot so označeni s števili. Naš tajnopis se tako glasi

source: <strong> 1. </strong> Choose an image and then click<strong> Confirm </strong>. <br> <br><strong> 2. </strong> Click the <strong> Show images </strong> button.Then, the algorithm that separates one image into two, equally sized images, is run. Derived images are black and white, with each pixel (seems to be) selected at random.</br><strong> 3. </strong> Click on the <strong> Show animation </strong>. <br>It starts the animation of overlapping two derived images. At the point of complete overlap, the initial image can be recognised.
sl: <strong>1.</strong> Izberi sliko in klikni gumb Potrdi.<br><br> <strong>2.</strong> Klikni gumb <strong>Prikaži delni sliki</strong>. Izvede se algoritem, ki izbrano sliko razstavi na dve enako veliki delni sliki, na katerih je vsaka točka naključno bela ali črna - torej šum.<br><br> <strong>3.</strong> Klikni gumb <strong>Prikaži animacijo</strong>. Prikaže se postopek prekrivanja obeh delnih slik - ko sta delni sliki prekriti, vidimo prvotno informacijo, ki pa se od originalne razlikuje po slabšem kontrastu. Kljub izgubi kontrasta pa so enostavne slike še vedno prepoznavne.<br>

source: The document is oversized!
sl: Datoteka je prevelika!

source: Hint
sl: Namig

source: The best result is achieved with two-color image.
sl: Najboljši rezultat boste dosegli z izbiro dvobarvne slike

source: Choose an image:
sl: Izberi sliko:

source: Show images
sl: Prikaži delni sliki

source: Show animation
sl: Prikaži animacijo

source: If you already have both partial images, drag each one into your frame, click the <strong> Show animation </strong> button to view the animation Warning: Images must be of the same dimensions!
sl: Če že imaš obe delni sliki, povleci vsako v svoj okvir, klikni gumb <strong>Prikaži animacijo</strong> in si oglej animacijo.<br> Opozorilo: Sliki morata biti enakih dimenzij!
