Repository: jaanos/crypto-portal
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: sl

source: Choosen alphabet unknown!
sl: Te abacede se ne poznam!

source: No document has been found with a certificate given.
sl: Z danim certifikatom ni bil potrjen noben dokument na tej strani.

source: Document with hash
sl: Dokument z zgoščevalno funkcijo

source: has been signed at
sl: je bil potrjen

source: Instructions:
sl: Navodila

source: From displayed (latin) letters, <strong> choose </strong> the one that is represented by <strong> the picture </strong>. </br> </br> If the choice is <strong>correct</strong>, the button will turn green and click on the right arrow will show you a new task. </br> </br> If the choice is <strong>wrong </strong>, the button will turn red. In this case you can <strong> try again </strong>, until you choose the correct one. Every<strong>wrong</strong> selection is <strong>punished</strong> with a negative point.</br></br> By clicking on the left arrow, you can see the history of your answers.
sl: Izmed ponujenih <strong>izberite</strong> tisto, ki jo <strong>predstavlja</strong> prikazana črka.</br></br> Če bo izbrana slika <strong>pravilna</strong>, se bo gumb obarval zeleno in po kliku na desno puščico se vam bo prikazala nova naloga.</br></br> Če bo izbira <strong>napačna</strong> , se bo gumb obarval rdeče. V tem primeru lahko poskusite <strong>ponovno</strong>, dokler ne izberete pravilne rešitve. Vsaka <strong>napačna</strong> izbira se kaznuje with a negative point.By clicking on the left arrow, you can see the history of your answers.

source: In the box below the image <strong>enter the letter </strong>represented by the image, and click <strong>enter</strong>. </br> </br>If your answer is <strong>correct</strong>, the lower edge of the field will turn green, otherwise red. </br> </br> In the case of <strong>correct</strong> answer, click on the right arrow will lead you to the new task. In the case of <strong>wrong</strong> answer, you are able to try again. </br></br> Note: If you have earned enough points (with previous tasks), click on the <strong> Solve </strong>button, will show you the correct answer for the cost of (losing) few points.</br></br> By clicking on the left arrow, you can see the history of your answers.
sl: V polje pod sliko <strong>vnesite črko</strong>, ki jo slika predstavlja, in <strong>pritisnite enter </strong>.</br></br>Če je vaš odgovor <strong>pravilen</strong> , se bo spodnji rob polja obarval zeleno, sicer rdeče.</br></br> V primeru <strong>pravilnega</strong> odgovora se vam ob kliku na desno puščico prikaže nova naloga, v primeru <strong>napačnega</strong> odgovora pa lahko poskusite znova.</br></br> Če ste s prejšnjimi nalogami zbrali dovolj točk, lahko s klikom na gumb <strong>Rešitev</strong> izveste, katero črko predstavlja slika (s tem izgubite nekaj svojih točk).</br></br> S klikom na levo puščico si lahko pogledate zgodovino svojih odgovorov.

source: Click on the <strong> Start </strong> button to launch the animation. </br> </br> You will be presented with a sequence of images, of whicheach showing one letter. Enter the letter shown on the image below each image and click <strong> Enter </strong>.The field to which you have entered the correct letter will turn <strong>green</strong>, and with the incorrect letter will turn <strong>red</strong> . Blank fields will remain <strong> unchanged </strong>. </br> </br> For each correctly entered letter you <strong> get one point </strong>. For each incorrectly entered letter you <strong> lose one point.</strong> If you have collected enough points with previous tasks, you can click on <strong> the button Start </strong> to change the presented sequence of images. By doing so, you lose some points.</br></br> By clicking on the left arrow, you can see the history of your answers.
sl: S klikom na gumb <strong>Začni</strong> sprožite animacijo.</br></br> Prikazalo se vam bo zaporedje slik, od katerih bo vsaka prikazovala eno črko. Črke vnesite v polja pod sliko in <strong>pritisnite enter</strong>. Polja, kamor ste vnesli pravilno črko, se bodo obarvala <strong>zeleno</strong>, polja z napačno črko <strong>rdeče</strong> , prazna polja pa bodo ostala <strong>nespremenjena</strong>.</br></br> Za vsako pravilno vnešeno črko <strong>dobite</strong> eno točko, medtem ko za vsako napačno vnešeno črko no točko <strong>izgubite</strong>. Prazno polje točk ne spreminja.</br></br> Če ste s prejšnjimi nalogami zbrali <strong>dovolj točk</strong>, lahko s klikom na gumb <strong>Začni znova</strong> animacijo sprožite še enkrat (s tem izgubite nekaj svojih točk).</br></br> S klikom na levo puščico si lahko pogledate zgodovino svojih odgovorov.

source: From displayed images, <strong> choose </strong> the one representing <strong> the letter shown </strong>. </br> </br> If the choice is <strong>correct</strong>, the button will turn green and click on the right arrow will show you a new task. </br> </br> If the choice is <strong>wrong</strong> , the button will turn red. In this case you can <strong> try again </strong>, until you choose the correct one. Every <strong>wrong</strong>answer<strong>is punished</strong> with a negative point</br></br> By clicking on the left arrow, you can see the history of your answers.
sl: Izmed ponujenih slik <strong>izberite</strong> tisto, ki jo <strong>predstavlja</strong> prikazana črka.</br></br> Če bo izbrana slika <strong>pravilna</strong>, se bo gumb obarval zeleno in po kliku na desno puščico se vam bo prikazala nova naloga.</br></br> Če bo izbira <strong>napačna</strong>, se bo gumb obarval rdeče. V tem primeru lahko poskusite <strong>ponovno</strong>, dokler ne izberete pravilne rešitve. Vsaka <strong>napačna</strong> izbira se <strong>kaznuje</strong> z negativno točko.</br></br> S klikom na levo puščico si lahko pogledate zgodovino svojih odgovorov.

source: Click and <strong>rotate</strong> each flag until you get the layout that represents the (latin) letter above. Then click <strong> the check mark </strong> below the image. </br> </br> If the layout is correc <strong>correct</strong> , the check mark will turn green and a click on the right arrow will show the next task.</br> But, if your answer is <strong>wrong</strong>, the check mark will turn red, and the field above will (shortly) show the letter presented by the current layout of flags.</br></br> By clicking on the left arrow, you can see the history of your answers.
sl: Kliknite in <strong>zavrtite</strong> neosenčeno zastavico v pravilen položaj in kliknite <strong>kjukico</strong> pod sliko.</br></br> Če je vaš odgovor <strong>pravilen</strong> , se kljukica obarva zeleno in s klikom na desno puščico se vam prikaže naslednja naloga.</br></br> Če pa je vaš odgovor <strong>napačen</strong>, se kjukica obarva rdeče, v polju s črko pa se za <strong>trenutek prikaže črka</strong>, ki jo predstavlja trenutna postavitev rok.</br></br> S klikom na levo puščico si lahko pogledate zgodovino svojih odgovorov.

source: Click and <strong>rotate</strong> each flag until you get the layout that represents the (latin) letter above. Then click <strong> the check mark </strong> below the image. </br> </br> If the layout is correc <strong>correct</strong> , the check mark will turn green and a click on the right arrow will show the next task.</br> But, if your answer is <strong>wrong</strong>, the check mark will turn red, and the field above will (shortly) show the letter presented by the current layout of flags.</br></br> Notation: <br>When placing a flag in the correct layout, it will get dimmed and you can not move it any further. By clicking on the left arrow, you can see the history of your answers.
sl: Kliknite in <strong>zavrtite</strong> neosenčeno zastavico v pravilen položaj in kliknite <strong>kjukico</strong> pod sliko.</br></br> Če je vaš odgovor <strong>pravilen</strong> , se kljukica obarva zeleno in s klikom na desno puščico se vam prikaže naslednja naloga.</br></br> Če pa je vaš odgovor <strong>napačen</strong>, se kjukica obarva rdeče, v polju s črko pa se za <strong>trenutek prikaže črka</strong>, ki jo predstavlja trenutna postavitev rok.</br></br> Če pravilno postavite le eno zastavico, se onemogoči njeno premikanje. S klikom na levo puščico si lahko pogledate zgodovino svojih odgovorov.

source: Semaphor
sl: Semafor

source: Instructions
sl: Navodila

source: Convert from Latin
sl: Pisanje

source: Easy
sl: Lahko

source: Hard
sl: Težko

source: Convert to Latin
sl: Branje

source: Medium
sl: Srednje

source: Welcome to pages which learn you how to communicate using different alphabets.
sl: Dobrodošli na strani za učenje komuniciranje s pomočjo tujih abeced.

source: About the alphabet:
sl: Na kratko o izbrani abecedi:

source: This alphabet is useful when transmitting messages between two parties which are too far to hear, but they can still see each other.
sl: Ta abeceda je uporabna za prenašanje sporočil na daljavo, ko sta sogovornika predaleč narazen, da bi se slišala, se pa še lahko vidita.

source: Below, you can see a list of letters, which correspond to the alphabetand can be learnedusing this pages. To view a single symbol click on the appropriate card.
sl: Spodaj si lahko ogledate seznam vseh črk, ki se jih lahko naučite s pomočjo te aplikacije. Za ogled posameznega simbola kliknite na ustrezno kartico.

source: Ready to start?
sl: Pripravljeni, da začnete?

source: Correctly answered
sl: Število pravilnih odgovorov

source: Solve
sl: Rešitev

source: From displayed (latin) letters, <strong> choose </strong> the one that is represented by <strong> the picture </strong>. </br> </br> If the choice is <strong>correct</strong>, the button will turn green and click on the right arrow will show you a new task. </br> </br> If the choice is <strong>wrong </strong>, the button will turn red. In this case you can <strong> try again </strong>, until you choose the correct one. Every<strong>wrong</strong> selection is <strong>punished</strong> with a negative point.</br></br> By clicking on the left arrow, you can see the history of your answers.
sl: Izmed ponujenih slik <strong>izberite</strong> tisto, ki jo <strong>predstavlja</strong> prikazana črka.</br></br> Če bo izbrana slika <strong>pravilna</strong>, se bo gumb obarval zeleno in po kliku na desno puščico se vam bo prikazala nova naloga.</br></br> Če bo izbira <strong>napačna</strong>, se bo gumb obarval rdeče. V tem primeru lahko poskusite <strong>ponovno</strong>, dokler ne izberete pravilne rešitve. Vsaka <strong>napačna</strong> izbira se <strong>kaznuje</strong> z negativno točko.</br></br> S klikom na levo puščico si lahko pogledate zgodovino svojih odgovorov.

source: Click on the <strong> Start </strong> button to launch the animation. </br> </br> You will be presented with a sequence of images, of whicheach showing one letter. Enter the letter shown on the image below each image and click <strong> Enter </strong>.The field to which you have entered the correct letter will turn <strong>green</strong>, and with the incorrect letter will turn <strong>red</strong> . Blank fields will remain <strong> unchanged </strong>. </br> </br> For each correctly entered letter you <strong> get one point </strong>. For each incorrectly entered letter you <strong> lose one point.</strong> If you have collected enough points with previous tasks, you can click on <strong> the button Start </strong> to change the presented sequence of images. By doing so, you lose some points.</br></br> By clicking on the left arrow, you can see the history of your answers.
sl: S klikom na gumb <strong>Začni</strong> sprožite animacijo.</br></br> Prikazalo se vam bo zaporedje slik, od katerih bo vsaka prikazovala eno črko. Črke vnesite v polja pod sliko in <strong>pritisnite enter</strong>. Polja, kamor ste vnesli pravilno črko, se bodo obarvala <strong>zeleno</strong>, polja z napačno črko <strong>rdeče</strong> , prazna polja pa bodo ostala <strong>nespremenjena</strong>.</br></br> Za vsako pravilno vnešeno črko <strong>dobite</strong> eno točko, medtem ko za vsako napačno vnešeno črko eno točko <strong>izgubite</strong>. Prazno polje točk ne spreminja.</br></br> Če ste s prejšnjimi nalogami zbrali <strong>dovolj točk</strong>, lahko s klikom na gumb <strong>Začni znova</strong> animacijo sprožite še enkrat (s tem izgubite nekaj svojih točk).</br></br> S klikom na levo puščico si lahko pogledate zgodovino svojih odgovorov.

source: From displayed images, <strong> choose </strong> the one representing <strong> the letter shown </strong>. </br> </br> If the choice is <stron>correct</strong> , the button will turn green and click on the right arrow will show you a new task. </br> </br> If the choice is <strong>wrong</strong> , the button will turn red. In this case you can <strong> try again </strong>, until you choose the correct one. Every <strong>wrong</strong> selection <strong>is punished</strong> with negative point</br></br> By clicking on the left arrow, you can see the history of your answers.
sl: Izmed ponujenih slik <strong>izberite</strong> tisto, ki jo <strong>predstavlja</strong> prikazana črka.</br></br> Če bo izbrana slika <strong>pravilna</strong>, se bo gumb obarval zeleno in po kliku na desno puščico se vam bo prikazala nova naloga.</br></br> Če bo izbira <strong>napačna</strong>, se bo gumb obarval rdeče. V tem primeru lahko poskusite <strong>ponovno</strong>, dokler ne izberete pravilne rešitve. Vsaka <strong>napačna</strong> izbira se <strong>kaznuje</strong> z negativno točko.</br></br> S klikom na levo puščico si lahko pogledate zgodovino svojih odgovorov.

source: <strong> Choose </strong> the image that <strong> represents </strong> the individual letter and drag and drop it to the corresponding field. </br> </br>If your choice is <strong>correct</strong> the field will turn green. If the choice is incorrect the field will turn <stron>red</strong>. Every correct answer is valued one point, and every incorrect answer, minus one point. To <strong> clear </strong> the choice, transfer the desired image from the field to <strong> the trash </strong>. <br> You can move to the next task, only if all the images are selected correctly.</br></br> By clicking on the left arrow, you can see the history of your answers.
sl: Izmed vseh ponujenih slik <strong>izberite</strong> tisto, ki jo <strong>predstavlja</strong> posamezna črka ter jo povlecite in spustite v pripadajoče polje.</br></br> Za vse <strong>pravilne</strong> izbire se pripadajoča polja obarvajo zeleno, za vse <strong>napačne rdeče</strong>. Pravilni odgovori so nagrajeni, napačni pa kaznovani, z eno točko. </br></br> Če želite <strong>počistiti</strong> svojo izbiro, željeno sliko iz polja prenesite v <strong>smeti</strong>. S klikom na kljukico preverite svojo izbiro. Ko bodo vsa polja pravilno izbrana se lahko pomaknete na naslednjo nalogo.</br></br> S klikom na levo puščico si lahko pogledate zgodovino svojih odgovorov.

source: Finger alphabet
sl: Znakovna abeceda

source: Greek alphabet
sl: Grška abeceda

source: Below, you can see a list of letters, which correspond to the alphabetand can be learnedusing this pages. To view a single symbol click on the appropriatecard.
sl: Spodaj si lahko ogledate seznam vseh črk, ki se jih lahko naučite s pomočjo te aplikacije. Za ogled posameznega simbola kliknite na ustrezno kartico.

source: Start!
sl: Začni!

source: Hash functions
sl: Zgoščevalne funkcije

source: Hashing is the transformation of a string of characters into a usually shorter fixed-length value or key that represents the original string. The representation is choosen within a fixed-range. The transformation is mainly done using a function of a special kind, namely, mathematical hash functions. A function mush have following properties.
sl: Zgoščevanje je generiranje neke vrednosti iz poljubnega niza znakov s pomočjo matematične funkcije. Zgoščevalna funkcija pa je funkcija, ki vzame nek vhodni niz in generira drugačen niz, za njo pa morajo veljati pravila.

source: <li>It has to be deterministic, e.g. for the same input, it returns the same output.</li><li>It needs to be deterministic, e.g. the possibility to get the same output for the same input is smaller that being hit by the meteor. This really hard to achieve. So, we are satisfied if the possibility is really close to the possibility of being hit by the airplane while driving in a black car.</li><li>It accepts strings of (almost) arbitray size, but the length of the output is fixed.</li><li>It needs to be one way, e.g. observing an input it is as possible to reveal the input as being hit by the spaceship. (To be honest, this variates from the application.)</li>
sl: <li>Zgoščevalne funkcijo morajo biti deterministične, kar pomeni, da morajo za določen vhod vedno vrniti enak izhod.</li> <li>Zgoščevalne funkcije morajo stremeti k temu, da so uniformne, torej da dva različna vhoda ne moreta tvoriti enakega izhoda. To je v praksi zelo težko doseči in so ponavadi zadovoljive zgoščevalne funkcije, kjer je verjetnost sovpadanja dovolj majhna.</li> <li>Zgoščevalne funkcije vzamejo vhodni niz poljubne dolžine in ga pretvorijo v niz točno določene dolžine.</li> <li>Zgoščevalne funkcije morajo oz. morajo stremeti k temu, da so enosmerne, kar pomeni, da iz izhoda ne smemo dobiti vhodnega parametra.</li>

source: Isn't is great to have examples? Our is about one gang. The gang has 5 members: <ul> <li>Janez Korenina</li> <li>Zala Novak</li> <li>Miha Copatar</li> <li>Zvonko Nagode</li> <li>Tone Rastlina</li> </ul><br><br>The gang members never call each other by name! Why? <br> Well, you know the gang, always in want to hide something... And if there is no eyes, ears are everywhere. So, they decided to give themself code names. Imagine, they call each other only by initials (!WOW!). This way, knowing that ZN did something, does not tell us who really did it. It could be Zrinka Novakovič or Zvonimir Nikša or Zlata Nikšić, who knows ?!?! <br> <small>Disclamer: No one outside the gang knows who is in the gang.</small> <br> <br> Let us now observe the rule that transforms name of the gang member into the code name. Well, it is actually one example of the hash function. Let's denote it with <code>F()</code>.<br><br>Buuut, does it really have all abovementioned properties?
sl: Recimo, da imamo v razredu 5 učencev. <ul> <li>Janez Korenina</li> <li>Zala Novak</li> <li>Miha Copatar</li> <li>Zvonko Nagode</li> <li>Tone Rastlina</li> </ul> <br> Vzamimo funkcijo F, ki za vhod prejme učenca in ga zapiše kot niz začetnic imena in priimka. Dobimo torej vrednosti, kot so JK, ZN, itd.

source: Is is really a mathematiacal hash function <code>F()</code>?<ul><li>Property 1 holds, e.g. Janez Korenina is always transformed into JK.</li><li>But, property 2 does not, i.e. Zala Novak and Zvonko Nagode transform into the same code name: ZNThe probability that the collision happens within the gang of 5 is lower than 1,6 percentage which is pretty much in a world of hash functions, as to be hit by the meteor is 0.000001 percentage.Unfortunatelly for the gang, this probability rises as new people comes to the gang. When the gang is of size 20, the same probability is 26,5 percentage. </li><li>Property 3 holds. At least that! The gang should be happy that their code namesare always of length 2.</li><li>Property 4 does not hold inside the gang, e.g. when saying ZN,the gang knows that that must be Zala Novak. But outside the gang it is holds pretty well!! Both suits the gang pretty well.</ul>
sl: Bi lahko rekli funkciji F zgoščevalna funkcija? <ul> <li>Pogoj 1 je izpolnjen, saj bo Janez Korenina vsakič zgoščen v JK.</li> <li>Pogoj 2 ni izpolnjen, saj Zala Novak in Zvonko Nagode tvorita enak izhod, tj. ZN. Verjetnost, da imata izmed petih učencev dva enake začetnice, je sicer majhna (1,6 posto), a v svetu zgoščevalnih funkcij je to ogromno. Kot primer lahko vzamemo tudi scenarij, kjer je v razredu 20 učencev. Takrat je verjetnost, da imata dva učenca enak izhod že 26,5 posto .</li> <li>Pogoj 3 je izpolnjen, saj je izhod vedno dolžine 2 (ignorirajmo za zdaj primere, ko ima učenec več kot eno ime ali priimek).</li> <li>Pogoj 4 ni izpolnjen, saj iz izhoda lahko vidimo, kakšen je bil vhod. Npr. ZN ne more biti nič drugega kot Zala Novak, saj je edina z začetnicami Z in N. Tudi v primeru, ko obstajata dva ali več učencev z istimi začetnicami, lahko omejimo možen nabor imen, ki jim pripada.</li> </ul>
