Repository: jaanos/crypto-portal
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: sl

source: So, <code>F()</code> suits the purpose for the gang (as long as they are small gang), but it is not a real mathemathical hash function.If Zdravka Najc become member, they get COLLISION. Now, when talking about ZN, no one knows who they are talking about. Not even them. Pretty bad. A solution? Lucky for them, there is always some solution, just waiting around the corner. Smart guys invented some pretty MEAN hash functions, i.e. SHA-512, Bcrypt etc. <br><br>Beside for gang-bussines, where else can we use hash functions? Are they used at all? Ofcourse. Let us list JUST some.<ul><li>Saving data in a (hash) table. Now, when searching the table, we just search for corresponding hash. – Insted for searching row by row, for some long name or so, calculating the hash of it provides us with (almost) instant reference to the data we want. This is explained in 'programming' language. If you do not understand it, it is fine :) No one does for real.</li><li>Checking if two inputs are the same. - Imagine having two documents of at least 50 pages. You want to check if they are not equal, and after a day, two, three, you conclude that they actually ARE NOT!! The only difference is the last word. What a wast of time. Expecially when there is an easier way. You could have done this but only calculating the hash of each. So, if they are not equal, you have your statement! :).<br> As the smallest change in the input should have change the output. Furthermore, if two hashes turn out identical, we usually conclude that the input was the same as well. This is actually used during the file transfer process.</li><li>Storing posswords. - In a case of having a portal with a registration, to keep VERY passwords secret (even to you). You never store actual passwords , but need to still be able to check it the user name maches the password. Insted of the password, you only store password-hashes. Ofcourse, each hash is stored together with corresponding username. <br>This way, if anyone attacks aour storage, it will not be able to obtain passwords as there are none. This makes users happy. (At least until they forget their password).</li> </ul>
sl: Kot vidimo, ta F() ne bi bil kaj preveč prida, zato bi si morali izmisliti boljšo zgoščevalno funkcijo. Na srečo pa lahko izberemo že kakšno izmed obstoječih, kot so SHA-256, SHA-512, Bcrypt in mnoge druge. <br> Kje se zgoščevanje uporablja? <ul> <li>Shranjevanje podatkov v tabeli - Namesto, da iščemo nek zapis po tabeli, lahko izračunamo zgostitev in takoj skočimo na mesto v tabeli, ki ga referencira ta zgostitev. Bolj kot lastnost enosmernosti je tukaj pomembno, da pri zgoščevanju prihaja do čim manj sovpadanj.</li> <li>Preverjanje enakosti podatkov - Tukaj gre za zgoščevalne funkcije, kjer si želimo, da tudi najmanjša sprememba v vhodnem nizu vrne čim bolj različno zgoščeno vrednost. Predvsem se uporablja pri preverjanju pravilnosti oz. enakosti podatkov. Če imamo na voljo zgostitev nekih podatkov, ki ji zaupamo, da je prava, lahko zgostitev izračunamo sami in primerjamo. Če je enaka, so podatki najverjetneje identični. Uporablja se pri prenosu datotek, itd.</li> <li>Shranjevanje gesel - Namesto, da bi shranili gesla v svoji prvotni obliki, shranimo zgoščene vrednosti gesel v bazo. Tako zagotovimo, da gesla uporabnikov ostanejo neznana, tudi če napadalec vdre v naš sistem. Pomankljivost takšnega shranjevanje gesel so postale t.i. mavrične tabele, ki vsebujejo slovar gesel in njihovih zgoščenih vrednosti v različnih algoritmih, ki so jih nepridipravi odkrili do sedaj. To pa lahko rešimo na enostaven način, in sicer tako, da uporabnikovemu geslu dodamo t. i. <em>sol</em>. To je naključen niz, ki ga potem skupaj z geslom zgostimo in shranimo v podatkovno bazo. Ta naključnost zagotovi, da v mavričnih tabelah, tudi če obstaja zapis za geslo, ne najdemo takšnega zapisa.</li> </ul>

source: Sequence hashing
sl: Zgoščevanje niza

source: Choose the hashing function
sl: Izberite zgoščevalno funkcijo

source: The hash
sl: Zgoščen niz

source: Cryptogram
sl: Kriptogram

source: Substitution
sl: Zamenjalka

source: Level
sl: Težavnosti

source: Caesar cipher
sl: Cezarjeva šifra

source: Scoreboard
sl: Lestvice

source: Substitution puzzles
sl: Pripravljene zamenjalke

source: Transposition
sl: Premešalka

source: What are transposition ciphers?
sl: Kaj so transpozicijske šifre?

source: TransGAME (by levels)
sl: Naloge (lahko/srednje/težko)

source: Steganography
sl: Steganografija

source: Hide a message in a image
sl: Skrivanje sporočila v sliko

source: Visual cryptography
sl: Vizualna kriptografija

source: Alphabet
sl: Abeceda

source: Timestamp
sl: Časovni žig

source: What is a timestamp?
sl: Kaj je časovni žig?

source: Timestamp a document
sl: Časovno žigosanje dokumenta

source: Check a timestamp
sl: Preverjanje časovnega žiga

source: Server's public key
sl: Javni ključ strežnika

source: Password
sl: Gesla

source: Hashing
sl: Zgoščevanje

source: Try yourself!
sl: Poizkusite sami!

source: Welcome to Cryptogram
sl: Dobrodošli na portalu Kriptogram!

source: Welcome to web-portal <strong>Cryptogram</strong>, is intended for all curious, especially for those who want to solve cryptographic puzzles.
sl: Dobrodošli na spletnem portalu ki je namenjen vsem vedoželjnim, še posebej tistim, ki radi rešujete kriptografske uganke.

source: Take your chances against several
sl: Sprehodite se v svet

source: substitution ciphers
sl: zamenjalk

source: and discover secret conversations and texts. Lern how
sl: in z reševanjem odkrivajte lepe pregovore in besedila. Poglejte si, kako lahko

source: to hide
sl: skrivate

source: hide and rediscover secret messages in a image. Learn new
sl: sporočila v slike in jih nato spet razberete. Naučite se novih

source: alphabets.
sl: abeced

source: They can talk for you, when you can not.
sl: s katerimi se lahko sporazumevate tudi, kadar ne morete govoriti.

source: What is CRYPTOGRAM?
sl: Kaj je kriptogram?

source: In general, a cryptogram denotes any encrypted text. If the cipher used is simple enough,the cryptogram can be deciphered by hand. Ciphers which are used the most, are substitution ciphers. Substitution ciphercipher a text by changing every letter of the text with a different letter or a number.
sl: Kriptogram je načeloma vsako zašifrirano sporočilo. Če je šifra, ki je uporabljena v takem besedilu, dovolj enostavna, lahko besedilo razkrijemo sami. Pogosto se uporabljajo zamenjalne šifre, pri kateri se vsaka črka zamenja z drugo črko ali številko.

source: Although, substitution ciphers were once used for more serious purposes, nowdays they are mostly used for entertainment, i.e. puzzels in newspapers or magazines where, to solve a puzzle, onceneeds to reconstruct an intial text from a cryptogram.
sl: Za rešitev uganke je potrebno tako poiskati prvotno sporočilo. Čeprav so včasih zamenjalne šifre uporabljali v resne namene, jih danes večinoma najdemo v zabavnem tisku, v časopisih ali revijah.

source: About the Cryptogram project
sl: O projektu

source: Web portal Cryptogram is developed as a part of the Innovative Project for Social Benefit (2017). It is a product of the collaboration of students fromthe Faculty of Computer and Information Science, University of Ljubljana, and members of the Slovenian Society of Cryptology.
sl: Spletni portal Kriptogram so študenti FRI skupaj s člani Društva kriptologov Slovenije (DKS) razvili v sklopu Študentskih inovativnih projektov za družbeno korist (2017).

source: Week's riddle
sl: Uganka tedna

source: Let assume we have a fly, blank spider and four (distant) nodes. The spider makes a net which fully connects all four nodes. The fly and the spider are placed in distant nodes. The fly cannot move and the spider moves randomly between nodes. Find the answers to following (interesting) questions:
sl: Pajkova mreža povezuje štiri enako oddaljena vozlišča na vseh šest načinov (mimogrede: zato telesu, ki nastane kot konveksna ogrinjača, matematiki rečejo četverec). V različnih vozliščih se nahajata muha in slepi pajek. Muha se ne more premakniti, pajek pa se premika naključno iz enega vozlišča v drugega.

source: What is the expected number of moves (between nodes) that the spider will make before it meets the fly?
sl: Koliko je pričakovano število obratov, preden pajek doseže muho?

source: What if the quadruple is replaced by </li> <li>the cube,</li> <li>the octahedar,</li> <li>dodecahedron, or</li> <li>icosahedron?</li> </ol>
sl: Kaj pa, če četverec nadomestimo z </li> <li>kocko,</li> <li>oktaedrom,</li> <li>dodekaedrom, ali</li> <li>ikozaedrom?</li> </ol>

source: This week's puzzle can be found at
sl: Tedensko uganko najdete na

source: FRI web-classroom.
sl: spletni učilnici FRI

source: Kvizko app
sl: Aplikacija Kvizko

source: The application is aimed for testing (and improving) your knowledge of various subject you have learned. Furthermore, it provides you thoughtful entertainment anywhere and anytime. <br><br>This app brings you various problems, i.e. form Bober and Presek over 40-year period.Solving problems, one can compete with others or use it as a free time preoccupation.
sl: Aplikacija je namenjena prenosu naravoslovnih ved izza pisalne mize, preobremenjene s kupi knjig in zvezkov v vsakdanje življenje. Omogočimo miselno zabavo kjerkoli in kadarkoli. <br><br>40 let skrbno izbranih problemov (z izpeljanimi rešitvami) približa široki množici mladih in starejših. Vsebuje odprti skupini Bober in Presek, preko katerih lahko vsakdo rešuje naloge za tekmovanja ali za krajšanje prostega časa.

source: Measure the strength of your password
sl: MERJENJE MOČI GESLA

source: PASSWORD
sl: GESLO

source: Password required
sl: Vpisati morate geslo

source: Enter the password
sl: Vpišite geslo

source: Password analysis results
sl: Informacvije o geslu

source: Approximate number of opperations to break the password:
sl: Približek števila ugibanj za razbitje gesla:

source: Approximate time to break the password:
sl: Časovna ocena razbijanja gesla:

source: Recommendations:
sl: Priporočila za geslo:

source: Additional notes:
sl: Opozorilo za geslo:

source: Choose the color
sl: Izberite barvo

source: Steganography is the practice of concealing data, i.e. file, message, image, withing another data. The goal is to hide data so that the secret message do not attract attention. Unlike cryptography, which primaly tries to protect the content of the message, steganography is primaly concerned with hidding the track of the message being sent. This site provides youwith an oracle for hiding (secret) messages in a picture. After hidding the message, you can observethe difference between initial and the resulted image. The difference is (almost) imposible to detectwith a naked eye. Therefore, it is colored in red. <br> An extension of the oracle allows you to check if your picture contains a secret message.
sl: Steganografija je veda o skrivanju podatkov npr. v sporočilo, sliko ali video. Za razliko od kriptografije oziroma šifriranja podatkov, katere cilj je narediti podatke neberljive, steganografija poskuša prikriti obstoj podatkov. Cilj je onemogočiti zaznavo podatkov, ki so skriti v navidez nepomembnih podatkih. Spletna stran omogoča skrivanje sporočila v sliko. Na spletno stran lahko naložite svojo sliko, vanjo pa lahko zakodirate sporočilo, ali pa ga razberete, če se sporočilo v sliki že nahaja. Razlik med originalno sliko in sliko s sporočilom ni mogoče videti s prostim očesom, zato stran omogoča tudi vizualni prikaz nastale razlike.

source: Warning
sl: Opozorilo

source: Choose an image!
sl: Izberite slikovno datoteko!

source: Warning!
sl: Opozorilo!

source: The document is oversized. Document size upload limit is 2BM.
sl: Datoteka je prevelika! Največja dovoljena 2 MB.

source: The message is too big to be hidden!
sl: V sliko poskušate zakodirati preveč besedila!

source: here is no message to be coded.
sl: V tekstovno polje niste vnesli besedila, ki ga želite zakodirati!

source: The document is oversized in dimensions. Document dimensions upload limit is 1000 x 1000px.
sl: Datoteka je prevelikih dimenzij. Maksimalna dovoljena dimenzija je 1000 x 1000 px.

source: Choose a picture:
sl: Izberi sliko:

source: Upload
sl: Naloži

source: Number of characters
sl: Število kodiranih znakov

source: characters
sl: znakov

source: Vpiši sporočilo...
sl: Message

source: Hide
sl: Skrij sporočilo

source: Rediscover
sl: Razkrij sporočilo

source: The image with the message
sl: Slika s sporočilom:

source: Download
sl: Prenesi

source: The difference between images:
sl: Razlika med slikama:

source: Show the difference
sl: Prikaži razliko

source: Congrads, you managed to solve the riddle in
sl: Čestitke uspelo vam je rešiti uganko v

source: min and
sl: minutah in

source: s!
sl: sekundah!

source: Confirm
sl: Potrdi

source: Click
sl: Prekliči

source: Check the input!
sl: Preverite svoj vnos!

source: Supstitution <br> cipher
sl: Zamenjalka

source: Sort by frequency
sl: Sortiraj po frekvenci

source: Supstitution<br> cipher
sl: Zamenjalka

source: Most common two-letter words:
sl: Najpogostejše dvočrkovne besede:

source: Most common three-letter words:
sl: Najpogostejše tročrkovne besede:

source: Choose a certificate to check the timestamp:
sl: Izberite potrdilo za preverjanje časovnega žiga:

source: Choose
sl: Izberi

source: In general, a timestamp is a time mark which ensures that a certain informationexisted at certain time. A trusted timestamp is a digital record that ensures the signature of a document with a valid digital certificate at a specific time point. It connects the dateand the time of the signature, with the data itself. The process of producing a (trusted)timestamp is called timestamping, and it is done in cryptographically secure manner. Timestamping is closely related to public key infrastructure (PKI).Thus, to explain timestamping, we first explain the concept of the PKI with the mailbox example.
sl: V splošnem je varni časovni žig digitalni zapis, ki zagotavlja podpis dokumenta z veljavnim digitalnim potrdilom v določenem časovnem trenutku in sicer na način, da povezuje datum in čas podpisa ter podatke v elektronski obliki na kriptografsko varen način. Preden pa si pogledamo natančneje namen in delovanje varnih časovnih žigov, pa je dobro, če si še na kratko pogledamo, kaj je to koncept javnih ključev.

source: When ones wants to send a letter to someone (recipient), it need to obtain recipient's address. After the letter has been sent and delivered to the address (public key), the letter is stored in the recipient's mailbox. To read the letter, recipient need to open its mailbox with the key (private key). Main elements of this example are: (1) twoparties (sender and receiver), (2) reveicers's address, and mailbox key, (3) the letter, (4) a will of two parties (of a party) to communicate or send data. The PKI has the same main elements (compounding parts). It enables transver of the data between parties. When exchanging data, the sender encipher a message with reciever's public key (address).The receiver, after receiving the message, deciphers the message with its private key (the mailbox's key). Let observe few things: (1) To send a message, the sender needs to put the mark on the message, to leave a trace for who is it for (like an address). It is done by enciphering the message with receiver's public key. This way, only receiver, holder of the corresponding private key can read the message., (2) If someone gets the message that is not itended for it, by deciphering it with its private key (tries to open someone else's mailbox) it gets giberish and can not rediscover (cannnot open the mailbox) data that has been sent. In PKI, every public-private key pair is choosen in a way that one can not be derived from the other. Each receiver is attached to one public-private pair. Private key is hold private to a receiver and public key is accessible to everyone. And how is this all connected with timestamping? This is going to be answer a bit later.
sl: Koncept javnih ključev si lahko predstavljamo kot pošiljanje pisem med dvema osebama. Če želimo nekomu poslati pismo, ga moramo poslati seveda naslovniku v njegov poštni nabiralnik. Ta lahko, ko pismo dobi, s svojim ključem odpre poštni nabiralnik, odpre pismo in ga prebere. Podobno deluje tudi sistem javnih in zasebnih ključev. Ko pošiljamo neko sporočilo naslovniku, uporabimo njegov javni ključ, da sporočilo zašifriramo, naslovnik pa s svojim zasebnim ključem sporočilo odšifrira in prebere naše sporočilo. S tem zagotovimo, da naše sporočilo lahko prebere le oseba, ki ji je namenjeno in njegova vsebina ni javno dostopna vsem poslušalcem. Par javnih in zasebnih ključev sta neki izbrani števili, ki ju ni možno izračunati, če poznamo le enega od njiju, in ju uporabljamo v formulah za šifriranje. Javni ključ je dostopen komurkoli, zasebni ključ pa zgolj lastniku. Zakaj je to pomembno za časovno žigosanje malo kasneje.

source: Now, let's give an everyday example of a trusted timestamping. Let's consider the situation in which one wants to sell a cellphone The person in want to sell an unused phone, puts and ad on the web. When a potential buyer sees the ad, it gets a bit suspicious. It is wondering if the phone is really unused or the seller is a fraud. Thus, the buyer contacts the seller, telling it about its suspition. Now, the seller needs to find the way to prove the condition (that is is unused) of the cell. The seller remembers that it can send a picture of an unopened cell's box and today's edition of its favourite newspapers. By doing so, it (can) convinces the buyer that the phone is unused at today's time point. So, the buyer buys the phone (today). If the buyer later claims that the phone come in a different shape, the picture tells it is is not seller's fault. So, what is the timestamp in this example? The picture, ofcourse. It tells us that the phone was unused at the timeof the purchase.
sl: Namen varnega časovnega žiga je zagotavljanje, da je nek določen dokument obstajal v trenutku žigosanja in se od takrat naprej ni spreminjal. Kot vsakdanji primer le-tega si lahko vzamemo prodajo mobitela. Na splet postavimo oglas, da prodajamo nov, še neuporabljen mobilni telefon. Potencialni kupec ta oglas vidi, vendar ne verjame, da telefon še ni bil uporabljen, zato še ni povsem prepričan, ali bi ga kupil. Ko nam to sporoči, se spomnimo, da mu lahko pošljemo sliko, kjer je neodprta škatla slikana z današnjo izdajo našega najljubšega časopisa, da mu zagotovimo, da zares prodajamo to, kar obljubljamo. Ker se za nakup odloči, mu ga še isti dan pošljemo. Če dobi kupec drugačno vsebino, kot mu je bila obljubljena, lahko s tem posnetkom dokažemo, da nismo mi krivi za to, ker je na dan oddaje bil izdelek še cel.

source: Getting back to the digital world. When we want to prove a condicion of a certain document at certain time, it is sent to a TSA (Time Stamping Authority) together with its hash value (the summary of the document). The hash is 160-bit long sequence. It uniquely determines the document. The TSA puts together the current time and the hash, and signs it with its private key. The product is timestamp. It proves that (this version of) the document existed before the time indicated in the timestamp. In addition, it can be verified. Thus, proving that the document hasn't been changed since the timestamping time. Verification can be done by preserving the current document hash, and checking it against the hash in the timestamp (when needed). The exact procedure is explained in RFC 3161: Internet X.509 Public Key Infrastructure - Time-Stamp Protocol (TSP).
sl: Ko želimo v neki aplikaciji časovno žigosati nek elektronski dokument oziroma podatke, pošljemo strežniku TSA (Time Stamping Authority oz. izdajatelj časovnih žigov za elektronske dokumente) z zgostitveno funkcijo narejen povzetek (hash) dokumenta oziroma podatkov. To je niz bitov fiksne dolžine (običajno 160 bitov), ki enolično določa dokument. Strežnik temu povzetku dopiše čas in vse skupaj podpiše s svojim zasebnim ključem - to je časovni žig. S tem je dokazano, da je elektronski dokument obstajal pred časom, navedenim v časovnem žigu, poleg tega pa se da preveriti, da se od časa žigosanja ni spremenil (naredimo ponovni povzetek dokumenta, ki se mora ujemati s tistim, ki je del časovnega žiga). Postopek je opisan v RFC 3161: Internet X.509 Public Key Infrastructure - Time-Stamp Protocol (TSP).

source: Timestamp was successfully created!
sl: Žigosanje uspešno!

source: Algorithm
sl: Algoritem

source: Timestamped by
sl: Žigosal

source: Cryptogram portal
sl: portal Kriptogram

source: Timestamping time: %(time)s
sl: Čas žigosanja: %(time)s

source: Download certificate
sl: Prenesi potrdilo

source: Do you want to check the hash of the document?
sl: Želite preveriti zgoščevalno funkcijo Vaše datoteke?

source: Choose a document:
sl: Izberite datoteko za preverjanje zgoščevalne funkcije:

source: Back
sl: Nazaj

source: Timestamping was unsuccessful. Try again.
sl: Žigosanje neuspešno. Poskusite ponovno.

source: Refresh
sl: Osveži

source: Download the key
sl: Prenesi ključ

source: Choose a document
sl: Izberite datoteko za časovno žigosanje:

source: Transposition chiper
sl: Premešalka

source: Using transponder chiper, the letters of the original message remain unchanged, and their places are mixed in a systematic way.
sl: V transpozicijski šifri ostanejo črke originalnega sporočila nespremenjene, njihova mesta pa so pomešana na nek sistematičen način.

source: Trans the columns
sl: Transpozicija stolpcev

source: Encoding by the rail fence can be done by zig-zag writing a message from left to right, then reading it by line.
sl: Šifriranje rail fence deluje tako, da cik-cakasto napišeš sporočilo od leve proti desni, nato prebereš besedilo po vrsticah.

source: Encryption
sl: ŠIFRIRANJE

source: Let's say you'd like to encrypt the message
sl: Recimo, da bi radi zašifrirali sporočilo

source: The encrypted message is obtained by reading this message by lines, from left to right:
sl: Šifrirano sporočilo pa dobimo tako, da to sporočilo preberemo po vrsticah, od leve proti desni:

source: The secret record is then
sl: Tajnopis se tako glasi

source: When encrypting with a route cipher, the message is written to a network of any size. The key tells us how to read the message to obtain a secret record.
sl: Pri šifriranju z route cipher se sporočilo napiše v mrežo poljubne velikosti. Ključ nam pove, kako to sporočilo beremo, da dobimo tajnopis.

source: Let's get the message back
sl: Dajmo ponovno vzeti sporočilo

source: which we write in the net. It will be of a size
sl: ki ga zapišemo v mrežo. Naj bo ta velikosti

source: We note that one field in the network remains blank. In this case, you can add any letter to fill it. Let's add the letter
sl: Opazimo, da ostane eno polje v mreži prazno. V tem primeru lahko dodamo poljubno črko, da jo zapolnimo. Dodajmo črko

source: Now we have to invent the key under which we will read. Let's take
sl: Zdaj si moramo izmisliti ključ, po katerem bomo brali. Recimo

source: We get a secret record
sl: Dobimo tajnopis

source: TRANS COLUMNS
sl: TRANSPOZICIJA STOLPCEV

source: As with the route cipher, this message is first entered into a network. The encrypted message is then obtained by reading the columns in some order.
sl: Tako kot pri route cipher se tu sporočilo najprej vpiše v neko mrežo. Šifrirano sporočilo nato dobimo tako, da v nekem vrstnem redu preberemo stolpce.

source: Let's take the message
sl: Ponovno vzemimo sporočilo

source: and write it in the 6x3 network, but this time we write the text by lines. We again replace the blank with the letter
sl: in ga vpišimo v mrežo 6x3, ampak tokrat zapišemo besedilo po vrsticah.S tem da prazno mesto spet zapolnimo s črko
